randread/150_node/job_1471009_fiojob_32/nid00058_fiojob_32/output.log
test: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=256
...
fio-3.27
Starting 32 processes
rand-read: Laying out IO file (1 file / 1024MiB)
rand-read: Laying out IO file (1 file / 1024MiB)
rand-read: Laying out IO file (1 file / 1024MiB)
[...]

test: (groupid=0, jobs=32): err= 0: pid=141761: Tue Jul 20 11:42:03 2021
  read: IOPS=432, BW=1729KiB/s (1771kB/s)(507MiB/300086msec)
    slat (msec): min=2, max=441, avg=73.98, stdev=23.52
    clat (usec): min=14, max=30088k, avg=18343963.87, stdev=4212478.33
     lat (msec): min=5, max=30188, avg=18417.95, stdev=4221.85
    clat percentiles (msec):
     |  1.00th=[ 2433],  5.00th=[14966], 10.00th=[16308], 20.00th=[16711],
     | 30.00th=[16979], 40.00th=[17113], 50.00th=[17113], 60.00th=[17113],
     | 70.00th=[17113], 80.00th=[17113], 90.00th=[17113], 95.00th=[17113],
     | 99.00th=[17113], 99.50th=[17113], 99.90th=[17113], 99.95th=[17113],
     | 99.99th=[17113]
   bw (  KiB/s): min=  800, max= 2352, per=99.07%, avg=1713.29, stdev= 7.01, samples=18100
   iops        : min=  200, max=  588, avg=428.32, stdev= 1.75, samples=18100
  lat (usec)   : 20=0.01%, 50=0.02%
  lat (msec)   : 10=0.01%, 20=0.01%, 50=0.03%, 100=0.05%, 250=0.14%
  lat (msec)   : 500=0.13%, 750=0.09%, 1000=0.08%, 2000=0.32%, >=2000=99.13%
  cpu          : usr=0.04%, sys=0.26%, ctx=129952, majf=0, minf=9455
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.2%, 16=0.4%, 32=0.8%, >=64=98.4%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=129724,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=256

Run status group 0 (all jobs):
   READ: bw=1729KiB/s (1771kB/s), 1729KiB/s-1729KiB/s (1771kB/s-1771kB/s), io=507MiB (531MB), run=300086-300086msec